{
	"name": "spell.animate-dead",
	"cast": { 
		"amount": 1,
		"unit": "unit.action"
	},
	"range": 10,
	"components": {
		"V": true,
		"S": true, 
		"M": ["a drop of blood", "a piece of flesh", "a pinch of bone dust"]
	},
	"duration": { 
		"amount": -1, 
		"unit": "unit.instant" 
	},
	"description": "This spell creates an undead servant. Choose a pile\r\nof bones or a corpse of a Medium or Sm all humanoid\r\nwithin range. Your spell im bues the target with a foul\r\nmimicry of life, raising it as an undead creature. The\r\ntarget becomes a skeleton if you chose bones or a\r\nzombie if you chose a corpse (the DM has the creature’s\r\ngame statistics).\r\nOn each of your turns, you can use a bonus action\r\nto mentally command any creature you made with\r\nthis spell if the creature is within 60 feet of you (if you\r\ncontrol multiple creatures, you can command any or all\r\nof them at the same time, issuing the same command to\r\neach one). You decide what action the creature will take\r\nand where it will move during its next turn, or you can\r\nissue a general command, such as to guard a particular\r\nchamber or corridor. If you issue no commands, the\r\ncreature only defends itself against hostile creatures.\r\nOnce given an order, the creature continues to follow it\r\nuntil its task is complete.\r\nThe creature is under your control for 24 hours,\r\nafter which it stops obeying any command you’ve given\r\nit. To maintain control of the creature for another\r\n24 hours, you must cast this spell on the creature\r\nagain before the current 24-hour period ends. This\r\nuse o f the spell reasserts your control over up to four\r\ncreatures you have animated with this spell, rather than\r\nanimating a new one.\r\nAt Higher Levels. W hen you cast this spell using a\r\nspell slot of 4th level or higher, you animate or reassert\r\ncontrol over two additional undead creatures for each\r\nslot level above 3rd. Each of the creatures must come\r\nfrom a different corpse or pile of bones.",
	"requirement": {
		"level": 3,
		"feature": 7
	}
}